from re import findall

########################################################################
#
# Используемая переменная:
# note_list – список нот и полутонов;
#
########################################################################
#
# Используемые функции:
# ord_note – возвращает цифровой индекс ноты;
# chr_note – возвращает текстовое представление ноты.
#
########################################################################

note_list = ["C","C#","D","D#","E","F","F#","G","G#","A","A#","B"]

########################################################################
#
# ord_note – возвращает цифровой индекс ноты.
#
########################################################################
#
# Используемые переменные:
# note - нота;
# octava - октава;
# ind - индекс ноты без учёта октавы.
#
########################################################################

def ord_note(note):
	if note == "-": return -1
	octava = int(findall(r'[0-9]',note)[0])
	ind = note_list.index(''.join(findall(r'\D',note)))
	return ind + octava*12

########################################################################
#
# chr_note – возвращает текстовое представление ноты.
#
########################################################################
#
# Используемая переменная:
# ind - индекс ноты.
#
########################################################################

def chr_note(ind):
	return note_list[ind%12]+str(ind//12)